---
kind: property
id: P:Autodesk.Revit.DB.Transform1D.Determinant
source: html/c25f5cb3-22db-32bd-e485-f7c9c9a97e92.htm
---
# Autodesk.Revit.DB.Transform1D.Determinant Property

The determinant of this transformation.

## Syntax (C#)
```csharp
public double Determinant { get; }
```